load-test/k6/results/test-4/2-min-ingestion-20-vus/insert-app_csharp_3.log

          /\      |‾‾| /‾‾/   /‾‾/
     /\  /  \     |  |/  /   /  /
    /  \/    \    |     (   /   ‾‾\ 
   /          \   |  |\  \ |  (‾)  |
  / __________ \  |__| \__\ \_____/ .io

     execution: local
        script: ./scripts/insert-app.js
        output: dashboard http://127.0.0.1:5665

     scenarios: (100.00%) 1 scenario, 20 max VUs, 2m30s max duration (incl. graceful stop):
              * default: 20 looping VUs for 2m0s (gracefulStop: 30s)


     _csharp_3......................: avg=5.407914 min=1.373  med=4.815  max=143.819  p(90)=8.2173 p(95)=9.748
     data_received..................: 89 MB  745 kB/s
     data_sent......................: 81 MB  679 kB/s
     http_req_blocked...............: avg=3.1µs    min=1µs    med=2µs    max=1.88ms   p(90)=3µs    p(95)=4µs
     http_req_connecting............: avg=300ns    min=0s     med=0s     max=1.32ms   p(90)=0s     p(95)=0s
     http_req_duration..............: avg=5.49ms   min=1.4ms  med=4.9ms  max=143.9ms  p(90)=8.32ms p(95)=9.85ms
       { expected_response:true }...: avg=5.49ms   min=1.4ms  med=4.9ms  max=143.9ms  p(90)=8.32ms p(95)=9.85ms
     http_req_failed................: 0.00%  ✓ 0           ✗ 421868
     http_req_receiving.............: avg=74.07µs  min=12µs   med=34µs   max=25.36ms  p(90)=71µs   p(95)=242µs
     http_req_sending...............: avg=16.53µs  min=5µs    med=14µs   max=13.99ms  p(90)=22µs   p(95)=27µs
     http_req_tls_handshaking.......: avg=0s       min=0s     med=0s     max=0s       p(90)=0s     p(95)=0s
     http_req_waiting...............: avg=5.4ms    min=1.37ms med=4.81ms max=143.81ms p(90)=8.21ms p(95)=9.74ms
     http_reqs......................: 421868 3515.406042/s
     iteration_duration.............: avg=5.67ms   min=1.58ms med=5.08ms max=144.09ms p(90)=8.5ms  p(95)=10.04ms
     iterations.....................: 421868 3515.406042/s
     vus............................: 20     min=20        max=20
     vus_max........................: 20     min=20        max=20


running (2m00.0s), 00/20 VUs, 421868 complete and 0 interrupted iterations
default ✓ [ 100% ] 20 VUs  2m0s