load-test/k6/results/test-4/2-min-ingestion-20-vus/insert-app_go_http_only.log

          /\      |‾‾| /‾‾/   /‾‾/
     /\  /  \     |  |/  /   /  /
    /  \/    \    |     (   /   ‾‾\ 
   /          \   |  |\  \ |  (‾)  |
  / __________ \  |__| \__\ \_____/ .io

     execution: local
        script: ./scripts/insert-app.js
        output: dashboard http://127.0.0.1:5665

     scenarios: (100.00%) 1 scenario, 20 max VUs, 2m30s max duration (incl. graceful stop):
              * default: 20 looping VUs for 2m0s (gracefulStop: 30s)


     _go_http_only..................: avg=3.673205 min=0.994  med=3.375  max=99.089  p(90)=5.11   p(95)=5.93
     data_received..................: 112 MB 937 kB/s
     data_sent......................: 121 MB 1.0 MB/s
     http_req_blocked...............: avg=2.93µs   min=1µs    med=2µs    max=6.03ms  p(90)=3µs    p(95)=4µs
     http_req_connecting............: avg=287ns    min=0s     med=0s     max=5.97ms  p(90)=0s     p(95)=0s
     http_req_duration..............: avg=3.72ms   min=1.02ms med=3.42ms max=99.16ms p(90)=5.16ms p(95)=5.98ms
       { expected_response:true }...: avg=3.72ms   min=1.02ms med=3.42ms max=99.16ms p(90)=5.16ms p(95)=5.98ms
     http_req_failed................: 0.00%  ✓ 0           ✗ 614246
     http_req_receiving.............: avg=33.47µs  min=11µs   med=29µs   max=30.1ms  p(90)=46µs   p(95)=58µs
     http_req_sending...............: avg=15.26µs  min=5µs    med=13µs   max=8.21ms  p(90)=21µs   p(95)=25µs
     http_req_tls_handshaking.......: avg=0s       min=0s     med=0s     max=0s      p(90)=0s     p(95)=0s
     http_req_waiting...............: avg=3.67ms   min=994µs  med=3.37ms max=99.08ms p(90)=5.11ms p(95)=5.93ms
     http_reqs......................: 614246 5118.506253/s
     iteration_duration.............: avg=3.89ms   min=1.11ms med=3.59ms max=99.52ms p(90)=5.33ms p(95)=6.16ms
     iterations.....................: 614246 5118.506253/s
     vus............................: 20     min=20        max=20
     vus_max........................: 20     min=20        max=20


running (2m00.0s), 00/20 VUs, 614246 complete and 0 interrupted iterations
default ✓ [ 100% ] 20 VUs  2m0s